
# p.56
# 오토세이브 반드시 켜두렴.
# vscode 코드에서 python 코드 실행하기 위한 확장프로그램 설치
print("Hello, PARKJINGAMMAX python!")
# 빈칸 -> 오른쪽 -> run python 또는 위에 실행할 코드줄에 대고 shift + enter -> 터미널에 글자 출력됨


# p.67 확인문제1
print("Hello!" * 3) # Hello! Hello! Hello!
print("혼자 공부하다 모르면 동영상 강의를 참고하세요!") # 혼자 공부하다 모르면 동영상 강의를 참고하세요!


# 인터프리터 이란 ? 파이썬 코드를 실행할 수 있는 도구( 한 줄 단위 번역 ) vs 컴파일 ( 파일 단위 번역 )
# 예] 중국어로 된 편지를 번역할 때 한번에 번역하면 컴파일 방식 , 한 줄씩 번역하면 인터프리터 방식

# 표현식,식별자,키워드,연산자 등 ====> 문장(코드) ====> 프로그램

# p.70 키워드 : 미리 만들어진 단어
import keyword        # 실행1
print(keyword.kwlist) # 실행2

# p.71 식별자 : 이름을 붙인 단어 , 변수명/함수명/클래스명 등등


# p.76 출력 : print()

print('# 하나만 출력합니다.')
print(10,20,30,40,"박진감 입니다.")
print() # 빈 줄 출력

# 한 줄씩 실행 : shift + enter
# 한번에 실행 : vscode 상단 오른쪽 실행버튼 클릭 ( 만약에 실행 중이면 터미널에서 EXIT() )

   

   


